using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Runtime.InteropServices;

namespace Ai.Hong.FileFormat
{
    unsafe class SPAFileFormat
    {
        public static string ErrorString = null;

        #region SPAHeaderDefine
        [StructLayout(LayoutKind.Explicit, Pack=1)]
        struct SPAHeader
        {
            [FieldOffset(0x00)]
            public Int32 specType;		//通常=03 
            [FieldOffset(0x04)]
            public Int32 dataCount;
            [FieldOffset(0x08)]
            public Int32 xType;			//01=cm-1
            [FieldOffset(0x0C)]
            public Int32 yType;			//0x0C=log(1/R), 0x0F=Single Beam
            [FieldOffset(0x10)]
            public float firstx;
            [FieldOffset(0x14)]
            public float lastx;
            [FieldOffset(0x18)]
            public Int32 unknown2;
            [FieldOffset(0x1C)]
            public Int32 scanPoints;		//扫描点数8480
            [FieldOffset(0x20)]
            public Int32 unknown3;
            [FieldOffset(0x24)]
            public Int32 sampleScans;		//样品扫描次数64
            [FieldOffset(0x28)]
            public Int32 sampleFTPeak;		//样品干涉图峰位4096
            [FieldOffset(0x2C)]
            public Int32 resolution;		//分辨率 = 32768 / resolution; 0x00表示分辨率为4cm-1
            [FieldOffset(0x30)]
            public Int32 bgFTPeak;			//背景干涉图峰位4096
            [FieldOffset(0x34)]
            public Int32 bgScans;			//背景扫描次数64
            [FieldOffset(0x38)]
            public float bgGrain;			//背景增益1.0
            [FieldOffset(0x3C)]
            public fixed byte unknown4[8];
            [FieldOffset(0x44)]
            public Int32 scanTime;			//采集时间(单位：0.01s)
            [FieldOffset(0x48)]
            public fixed byte unknown5[8];
            [FieldOffset(0x50)]
            public float lwn;
            [FieldOffset(0x54)]
            public float adaptRatio;		//采样间隔2.0
            [FieldOffset(0x58)]
            public Int32 unknown6;
            [FieldOffset(0x5C)]
            public float aperture;			//光阑100.0
            [FieldOffset(0x60)]
            public fixed byte unknown7[0x2C];
        }

        //仪器硬件信息
        [StructLayout(LayoutKind.Explicit,Pack=1)]
        struct InstrumentHeader
        {
            [FieldOffset(0x00)]
            public fixed byte unknown1[0x10];
            /// <summary>
            /// 数字化位数:  24
            /// </summary>
            [FieldOffset(0x10)]
            public UInt32 ADBits;		
            /// <summary>
            /// 高通滤波:  200.0000
            /// </summary>
            [FieldOffset(0x14)]
            public float highFilter;
            /// <summary>
            /// 低通滤波:  20000.0000
            /// </summary>
            [FieldOffset(0x18)]
            public float lowFilter;
            [FieldOffset(0x1C)]
            public fixed byte unknown2[0x10];
            /// <summary>
            /// 样品增益1.0
            /// </summary>
            [FieldOffset(0x2C)]
            public float sampleGrain;
            /// <summary>
            /// 动镜速度:  1.2659
            /// </summary>
            [FieldOffset(0x30)]
            public float speed;
            [FieldOffset(0x34)]
            public fixed byte unknown3[4];
        };

	    /// <summary>
	    /// 模型参数
	    /// </summary>
        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Ansi, Pack = 1)]
        struct ModelParameter
        {
            /// <summary>
            /// 全部光谱数量
            /// </summary>
            public Int32 allFileCount;
            /// <summary>
            /// 建模光谱数量
            /// </summary>
            public Int32 calFileCount;
            /// <summary>
            /// 内部验证光谱数量
            /// </summary>
            public Int32 innerTestFileCount;
            /// <summary>
            /// 外部验证光谱数量
            /// </summary>
            public Int32 outerTestFileCount;
            /// <summary>
            /// 光谱文件X轴起始波数
            /// </summary>
            public double fileFirstX;		//原始光谱X轴起始波数
            /// <summary>
            /// 光谱文件X轴结束波数
            /// </summary>
            public double fileLastX;		//原始光谱X轴结束波数
