using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Runtime.InteropServices;
using System.ComponentModel;
using System.Data;

namespace Ai.Hong.FileFormat
{
    unsafe class SPCFileFormat
    {
        #region SPCHeaderDefine
        [StructLayout(LayoutKind.Explicit, CharSet=CharSet.Ansi, Pack=1)]
        struct SPCHeaderaaa    //SPC文件头
        {
            [FieldOffset(0x00)]
            public byte ftflgs;	/* Flag bits defined below */  //文件格式
            [FieldOffset(0x01)]
            public byte fversn;	/* 0x4B=> new LSB 1st, 0x4C=> new MSB 1st, 0x4D=> old format */ //固定：4B
            [FieldOffset(0x02)]
            public byte fexper;	/* Instrument technique code (see below) 光谱种类*/ //固定：0
            [FieldOffset(0x03)]
            public byte fexp; 	/* Fraction scaling exponent integer (80h=>float) Y数值放大系数 2^fexp , 80H表示直接float*/  //固定：80H float
            [FieldOffset(0x04)]
            public UInt32 fnpts;	/* Integer number of points (or TXYXYS directory position) 设置TXYXYS表示开始节的位置*/	//数据点数量
            [FieldOffset(0x08)]
            public double ffirst;	/* Floating X coordinate of first point */		//开始X
            [FieldOffset(0x10)]
            public double flast;	/* Floating X coordinate of last point */		//结束X
            [FieldOffset(0x18)]
            public UInt32 fnsub;	/* Integer number of subfiles (1 if not TMULTI) */	//SubFile: 固定1
            [FieldOffset(0x1C)]
            public byte fxtype;	/* Type of X axis units (see definitions below) */	//X值类型
            [FieldOffset(0x1D)]
            public byte fytype;	/* Type of Y axis units (see definitions below) */	//Y值类型
            [FieldOffset(0x1E)]
            public byte fztype;	/* Type of Z axis units (see definitions below) */	//Z值类型
            [FieldOffset(0x1F)]
            public byte fpost;	/* Posting disposition (see GRAMSDDE.H) */		//? 02
            [FieldOffset(0x20)]
            public UInt32 fdate;	/* Date/Time LSB: min=6b,hour=5b,day=5b,month=4b,year=12b */  	//日期时间：
            [FieldOffset(0x24)]
            public fixed byte fres[9];	/* Resolution description text (null terminated) */	//	//分辨率描述
            [FieldOffset(0x2D)]
            public fixed byte fsource[9];	/* Source instrument description text (null terminated) */	//测量仪器描述
            [FieldOffset(0x36)]
            public UInt16 fpeakpt;	/* Peak point number for interferograms (0=not known) */	//干涉图峰位
            [FieldOffset(0x38)]
            public fixed float fspare[8];	/* Used for Array Basic storage*/			//?  0
            [FieldOffset(0x58)]
            public fixed byte fcmnt[130];	/* Null terminated comment ASCII text string */		//说明文字
            [FieldOffset(0xDA)]
            public fixed byte fcatxt[30];	/* X,Y,Z axis label strings if ftflgs=TALABS */		//X,y,z坐标轴文字(TABLABS)
            [FieldOffset(0xF8)]
            public UInt32 flogoff;	/* File offset to log block or 0 (see above) */			//log block的文件指针
            [FieldOffset(0xFC)]
            public UInt32 fmods;	/* File Modification Flags (see below: 1=A,2=B,4=C,8=D..) */	//文件修改标志
            [FieldOffset(0x100)]
            public byte fprocs;	/* Processing code (see GRAMSDDE.H) 与DDE有关*/				//? 0
            [FieldOffset(0x101)]
            public byte flevel;	/* Calibration level plus one (1 = not calibration data) 与DDE有关*/	//? 0
            [FieldOffset(0x102)]
            public UInt16 fsampin;	/* Sub-method sample injection number (1 = first or only )  与DDE有关*/	//? 0
            [FieldOffset(0x104)]
            public float ffactor;	/* Floating data multiplier concentration factor (IEEE-32) 与DDE有关*/	//放大系数
            [FieldOffset(0x108)]
            public fixed byte fmethod[48];	/* Method/program/data filename w/extensions comma list 与DDE有关*/	//? 0
            [FieldOffset(0x138)]
            public float fzinc;	/* Z subfile increment (0 = use 1st subnext-subfirst) */		//? 0
            [FieldOffset(0x13C)]
            public UInt32 fwplanes;	/* Number of planes for 4D with W dimension (0=normal) */	//? 0
            [FieldOffset(0x140)]
            public float fwinc;	/* W plane increment (only if fwplanes is not 0) */			//? 0
            [FieldOffset(0x144)]
            public byte fwtype;	/* Type of W axis units (see definitions below) */			//? 0
            [FieldOffset(0x145)]
            public fixed byte freserv[187]; /* Reserved (must be set to zero) */				//? 0

            //HeadSize:0x200
        }

        [StructLayout(LayoutKind.Sequential, CharSet = CharSet.Ansi, Pack = 1)]
        struct SPCHeader    //SPC文件头
        {
            public byte ftflgs;	/* Flag bits defined below */  //文件格式
            public byte fversn;	/* 0x4B=> new LSB 1st, 0x4C=> new MSB 1st, 0x4D=> old format */ //固定：4B
            public byte fexper;	/* Instrument technique code (see below) 光谱种类*/ //固定：0
            public byte fexp; 	/* Fraction scaling exponent integer (80h=>float) Y数值放大系数 2^fexp , 80H表示直接float*/  //固定：80H float
            public UInt32 fnpts;	/* Integer number of points (or TXYXYS directory position) 设置TXYXYS表示开始节的位置*/	//数据点数量
            public double ffirst;	/* Floating X coordinate of first point */		//开始X
            public double flast;	/* Floating X coordinate of last point */		//结束X
